Repository: Bytezz/IPLookup-gtk
Catalog: po/*.po
Languages: be, es, fr, hi, nl, pt_br, ru, tr, uk, vi

source: IP Lookup
fr: Recherche d’IP
nl: Ip-opzoeking
tr: IP Sorgula

source: Find info about an IP address
be: Атрымайце інфармацыю аб IP-адрасе
es: Buscar información sobre una dirección IP
fr: Trouver des informations à propos d’une adresse IP
hi: IP पते के बारे में जानकारी प्राप्त करें
nl: Vind informatie over ip-adressen
pt_br: Encontre informações sobre um endereço IP
ru: Находите информацию про IP адреса
tr: IP adresleri hakkındaki bilgileri bul
uk: Знаходьте інформацію про IP адреси
vi: Tìm thông tin về địa chỉ IP

source: Look up details such as the internet provider and geographic location for an IP address.
be: Паглядзіце такія дэталі, як інтэрнэт-правайдэр і геаграфічнае месцазнаходжанне IP-адраса.
es: Busca detalles como el proveedor de Internet y la ubicación geográfica de una dirección IP.
fr: Recherchez des détails comme le fournisseur d’accès à Internet et la position géographique d’une adresse IP donnée.
hi: IP पते के लिए इंटरनेट प्रदाता और भौगोलिक स्थान जैसे विवरण देखें।
nl: Vind uitgebreide informatie over een ip-adres, zoals de internetprovider en locatie.
pt_br: Pesquise detalhes como o provedor de internet e a localização geográfica de um endereço IP.
ru: Просматривайте такую информацию, как: интернет провайдер или географыческое расположение из IP адреса.
tr: IP adresi hakkında internet sağlayıcısı ve coğrafi konum gibi ayrıntılara bakın.
uk: Переглядайте таку інформацію, як: постачальник інтернет послуг або географічне розташування із IP адреси.
vi: Tra cứu thông tin chi tiết như nhà cung cấp mạng và vị trí địa lý của một địa chỉ IP.

source: Main Window
be: Галоўнае акно
es: Ventana principal
fr: Fenêtre principale
hi: मुख्य विंडो
nl: Hoofdvenster
pt_br: Janela Principal
ru: Главное окно
tr: Ana Pencere
uk: Головне вікно
vi: Cửa Sổ Chính

source: Add belarusian and update french translations.
es: Se agregaron traducciones al bielorruso y al francés actualizadas.
hi: बेलारूसी अनुवाद जोड़ा गया और फ़्रेंच अनुवाद अद्यतित।
nl: Nieuw: Wit-Russische vertaling - Bijgewerkt: Franse vertaling.
pt_br: Adicionar tradução bielorrussa e atualizar traduções em francês.
tr: Belarusça eklendi ve Fransızca çeviriler güncellendi.
vi: Thêm bản dịch tiếng Belarus và cập nhật bản dịch tiếng Pháp.

source: Update ukrainian and russian translations.
es: Traducciones actualizadas al ucraniano y al ruso.
hi: यूक्रेनी और रूसी अनुवाद अद्यतित।
nl: Bijgewerkt: Oekraïense en Russische vertalingen.
pt_br: Atualizar traduções ucranianas e russas.
tr: Ukraynaca ve Rusça çevirileri güncellendi.
vi: Cập nhật bản dịch tiếng Ukraine và tiếng Nga.

source: Improve about window.
be: Палепшана акно "Аб праграме".
es: Ventana 'Acerca de la aplicación' mejorada.
fr: Amélioration de la fenêtre À propos
hi: 'बारे में' विंडो में सुधार किया गया।
nl: Verbeterd: venster ‘Over’.
pt_br: Melhorar a janela Sobre.
ru: Улучшено окно "Про приложение".
tr: Hakkında penceresi iyileştirmeleri.
uk: Покращено вікно "Про додаток".
vi: Cải thiện cửa sổ Giới thiệu.

source: Port to AdwToolbarView.
be: Партыравана на AdwToolbarView.
es: Portado a AdwToolbarView.
fr: Portage vers AdwToolbarView.
hi: AdwToolbarView में पोर्ट किया गया।
nl: Nieuw: overgezet naar AdwToolbarView.
pt_br: Migrar para AdwToolbarView.
ru: Портировано на AdwToolbarView.
tr: AdwToolbarView'e güncellendi.
uk: Портовано до AdwToolbarView.
vi: Chuyển sang AdwToolbarView.

source: Use toast.
be: Цяпер выкарыстоўваюцца усплывальныя апавяшчэнні.
es: Ahora se utilizan notificaciones emergentes.
fr: Utilisation de notifications toasts.
hi: टोस्ट का उपयोग करता है।
nl: Nieuw: in-appmeldingen.
pt_br: Usar notificações toast.
ru: Теперь используются всплывающие уведомления.
tr: Bildirim kullan.
uk: Тепер будуть використовуватися спливаючі повідомлення.
vi: Sử dụng thông báo toast.

source: Improve primary menu.
be: Палепшана галоўнае меню.
es: Menú principal mejorado.
fr: Amélioration du menu principal.
hi: बेहतर प्राथमिक मेनू।
nl: Verbeterd: hoofdmenu.
pt_br: Melhorar o menu principal.
ru: Улучшено главное меню.
tr: Birincil menü iyileştirmeleri.
uk: Покращено головне меню.
vi: Cải thiện trình đơn chính.

source: Thanks Hari Rana.
be: Дзякуючы Hari Rana.
es: Gracias a Hari Rana.
fr: Remerciements à Hari Rana.
hi: धन्यवाद हरि राणा।
nl: Met dank aan Hari Rana.
pt_br: Obrigado, Hari Rana.
ru: Благодаря Hari Rana.
tr: Teşekkürler Hari Rana.
uk: Дякуючи Hari Rana.
vi: Cảm ơn Hari Rana.

source: Get your IP from menu.
be: Цяпер можна атрымаць ваш IP адрас з меню.
es: Obtenga su IP desde el menú.
fr: Obtenez votre adresse IP depuis le menu.
hi: मेनू से अपना IP प्राप्त करें।
nl: Zoek een ip-adres op via het menu.
pt_br: Obtenha seu IP pelo menu.
ru: Теперь можна получить ваш IP адрес из меню.
tr: IP'nizi menüden öğrenin.
uk: Тепер можна отримати вашу IP адресу через пункт в меню.
vi: Lấy IP của bạn từ trình đơn.

source: New icon! Thanks Jakub Steiner
be: Новы значок, дзякуючы Jakub Steiner
es: ¡Nuevo icono! Gracias a Jakub Steiner.
fr: Nouvelle icône ! Remerciements à Jakub Steiner
hi: नया चिह्न! धन्यवाद जैकब स्टीनर
nl: Nieuw pictogram, met dank aan Jakub Steiner
pt_br: Novo ícone! Obrigado, Jakub Steiner.
ru: Новая иконка, благодаря Jakub Steiner
tr: Yeni simge! Teşekkürler Jakub Steiner
uk: Нова піктограма, дякуючи Jakub Steiner
vi: Biểu tượng mới! Cảm ơn Jakub Steiner

source: Remember window size.
be: Цяпер акно праграмы будзе запамінаць памер.
es: Recordar el tamaño de la ventana.
fr: Taille de la fenêtre mémorisée
hi: विंडो का आकार याद रखें।
nl: Verbeterd: onthoud de vensterafmetingen na afsluiten.
pt_br: Lembrar tamanho da janela.
ru: Теперь окно приложения будет запоминать размер.
tr: Pencere boyutunu anımsa.
uk: Тепер додаток буде запам'ятовувати розмір вікна.
vi: Ghi nhớ kích thước cửa sổ.

source: Add left and right margins.
be: Дададзены водступы злева і справа.
es: Añadir márgenes izquierdo y derecho.
fr: Ajout de marges à gauche et à droite.
hi: बाएं और दाएं हाशिए जोड़ें।
nl: Nieuw: linker- en rechtermarges.
pt_br: Adicionar margens esquerda e direita.
ru: Добавлены отступы слева и справа.
tr: Sol ve sağ kenar boşlukları eklendi.
uk: Додано відступи з права і зліва.
vi: Thêm lề trái và phải.

source: Update Ukrainian and add Russian translations.
be: Абноўлены ўкраінскі і рускі пераклады.
es: Traducciones al ucraniano y al ruso actualizadas.
fr: Mise à jour de la traduction ukrainienne et ajout d’une traduction russe
hi: रूसी अनुवाद जोड़ा गया और यूक्रेनी अनुवाद अद्यतित।
nl: Bijgewerkt: Oekraïense vertaling - Nieuw: Russische vertaling.
pt_br: Atualizar ucraniano e adicionar traduções russas.
ru: Обновлен украинский и русский переводы.
tr: Ukraynaca çeviri güncellendi ve Rusça çeviri eklendi.
uk: Оновлено український і російський переклади.
vi: Cập nhật bản dịch tiếng Ukraine và thêm tiếng Nga.

source: Update Turkish translation.
be: Абноўлены турэцкі пераклад.
es: Traducción al turco actualizada.
fr: Mise à jour de la traduction turque.
hi: तुर्की अनुवाद अद्यतित।
nl: Bijgewerkt: Turkse vertaling.
pt_br: Atualizar tradução em turco.
ru: Обновлен турецкий перевод.
tr: Türkçe çeviri güncellendi.
uk: Оновлено турецький переклад.
vi: Cập nhật bản dịch tiếng Thổ Nhĩ Kỳ.

source: Hide IP field when input is not a domain name.
be: Цяпер надпіс з IP адрасам будзе хавацца, калі ўведзены тэкст гэта не назва дамена.
es: Ocultar el campo IP cuando la entrada no es un nombre de dominio.
fr: Masquage du champ de l’adresse IP quand la saisie n’est pas un nom de domaine.
hi: जब आगत डोमेन नाम न हो तो IP क्षेत्र छुपाएं।
nl: Verberg het ip-veld als er geen domeinnaam is ingevoerd.
pt_br: Ocultar campo de IP quando a entrada não for um nome de domínio.
ru: Теперь надпись с IP адресом будет прятаться, если введенный текст это не назва домена.
tr: Girdi alan adı değilse IP alanını gizle.
uk: Тепер напис з IP адресою буде ховатися, коли введений текст це не назва домену.
vi: Ẩn trường IP khi đầu vào không phải tên miền.

source: Show IP if a domain name is given.
be: Цяпер паказвае IP адрас, калі ўведзена імя дамена.
es: Mostrar la IP si se indica un nombre de dominio.
fr: Affichage de l’IP si un nom de domaine est donné
hi: यदि कोई डोमेन नाम दिया गया है तो IP दिखाएं।
nl: Toon het ip-veld als er een domeinnaam is ingevoerd.
pt_br: Mostrar IP se um nome de domínio for informado.
ru: Теперь показывает IP адрес, если введено имя домена.
tr: Alan adı girildiyse IP adresini göster.
uk: Тепер показує IP адресу, якщо дано назву домену.
vi: Hiển thị IP nếu nhập tên miền.

source: Ukrainian translation.
be: Украінскі пераклад.
es: Traducción al ucraniano.
fr: Traduction en ukrainien
hi: यूक्रेनी अनुवाद।
nl: Nieuw: Oekraïense vertaling.
pt_br: Tradução ucraniana.
ru: Украинский перевод.
tr: Ukraynaca çeviri eklendi.
uk: Український переклад.
vi: Bản dịch tiếng Ukraine.

source: Italian and french translation.
be: Італьянскі і французскі пераклад.
es: Traducción al italiano y al francés.
fr: Traductions italienne et française.
hi: इतालवी और फ़्रेंच अनुवाद।
nl: Nieuw: Italiaanse en Franse vertalingen.
pt_br: Traduções em italiano e francês.
ru: Италийский и французкие переводы.
tr: İtalyanca ve Fransızca çeviri eklendi.
uk: Італійський та французькі переклади.
vi: Bản dịch tiếng Ý và tiếng Pháp.

source: Add translation support.
be: Дададзена падтрымка перакладу.
es: Soporte de traducción añadido.
fr: Ajout de la prise en charge des traductions
hi: अनुवाद समर्थन जोड़ा गया।
nl: Nieuw: vertaalondersteuning.
pt_br: Adicionar suporte a tradução.
ru: Добавлена поддержка переводов.
tr: Çeviri desteği eklendi.
uk: Додано підтримку перекладів.
vi: Thêm hỗ trợ dịch thuật.

source: Add Turkish translation.
be: Дададзены турэцкі пераклад.
es: Traducción al turco añadida.
fr: Ajout d’une traduction turque
hi: तुर्की अनुवाद जोड़ा गया।
nl: Nieuw: Turkse vertaling.
pt_br: Adicionar tradução em turco.
ru: Добавлен турецкий перевод.
tr: Türkçe çeviri eklendi.
uk: Додано турецький переклад.
vi: Thêm bản dịch tiếng Thổ Nhĩ Kỳ.

source: Move from com.github to io.github
be: Перайшоў з com.github на io.github
es: Pasar de com.github a io.github
fr: Déplacement de com.github vers io.github
hi: com.github से io.github पर ले जाया गया
nl: Nieuw: verhuizing van com.github naar io.github
pt_br: Migrar de com.github para io.github.
ru: Перешел с com.github на io.github
tr: com.github yerine io.github kullanılmaya başlandı
uk: Перейшов з com.github на io.github
vi: Chuyển từ com.github sang io.github

source: Switch to org.gnome.Platform 44.
be: Перайшоў на платформу org.gnome.Platform 44.
es: Cambiar a org.gnome.Platform 44.
fr: Passage à org.gnome.Platform 44.
hi: org.gnome.Platform 44 पर बदला गया।
nl: Nieuw: overgezet naar org.gnome.Platform 44.
pt_br: Alterar para org.gnome.Platform 44.
ru: Перешел на платформу org.gnome.Platform 44.
tr: GNOME 44 platformuna geçildi.
uk: Перехід на org.gnome.Platform 44.
vi: Chuyển sang org.gnome.Platform 44.

source: Add Desktop Entry category.
be: Дададзена катэгорыя для значка праграмы.
es: Añadir categoría de entrada de escritorio.
fr: Ajout d’une catégorie d’entrée de bureau.
hi: डेस्कटॉप प्रविष्टि श्रेणी जोड़ी गई।
nl: Nieuw: categorie in desktopbestand.
pt_br: Adicionar categoria de entrada no desktop.
ru: Добавлена категория для ярлыка программы.
tr: Masaüstü Girdisi kategorisi eklendi.
uk: Додано категорію до посилання на програму.
vi: Thêm danh mục Desktop Entry.

source: First version. Just working, nothing fancy.
be: Першы рэліз. Проста працуе, нічога лішняга.
es: Primera versión. Funcionando, nada del otro mundo.
fr: Première version. Fonctionnelle, rien d’extraordinaire.
hi: प्रथम संस्करण। बस काम कर रहा हूँ, कुछ भी आकर्षक नहीं।
nl: De allereerste versie. Hij werkt, maar daar is dan ook alles mee gezegd.
pt_br: Primeira versão. Funcional, sem nada sofisticado.
ru: Первый релиз. Просто работает, ничего лишнего.
tr: İlk sürüm. Sadece çalışıyor, özel bir şey yok.
uk: Перший реліз. Просто працює, нічого зайвого.
vi: Phiên bản đầu tiên. Chỉ hoạt động, không cầu kỳ.

source: translator-credits
es: Haggen88
hi: Scrambled777 <weblate.scrambled777@simplelogin.com>
nl: Heimen Stoffels <vistausss@fastmail.com>
pt_br: Dwep
tr: Sabri Ünal <libreajans@gmail.com>
vi: Loc Huynh <huynhloc.contact@gmail.com>

source: Main Menu
be: Галоўнае меню
es: Menú principal
fr: Menu principal
hi: मुख्य मेनू
nl: Hoofdmenu
pt_br: Menu Principal
ru: Главное меню
tr: Ana Menü
uk: Головне меню
vi: Trình đơn chính

source: IP
nl: Ip-adres

source: Network
be: Сетка
es: Red
fr: Réseau
hi: नेटवर्क
nl: Netwerk
pt_br: Rede
ru: Сеть
tr: Ağ
uk: Мережа
vi: Mạng

source: ISP
be: Правайдэр
fr: FAI
nl: Provider
tr: Servis Sağlayıcı
vi: Nhà cung cấp

source: Org
be: Арганізацыя
fr: Organisation
hi: संगठन
nl: Organisatie
pt_br: Organização
ru: Организация
tr: Kurum
uk: Організація
vi: Tổ chức

source: Geo
be: Геалакацыя
fr: Géolocalisation
hi: भौगोलिक
nl: Locatie
pt_br: Geografia
ru: Геолокация
tr: Konum
uk: Геолокація
vi: Vị trí

source: City
be: Горад
es: Ciudad
fr: Ville
hi: शहर
nl: Plaats
pt_br: Cidade
ru: Город
tr: Şehir
uk: Місто
vi: Thành phố

source: Region
be: Рэгіён
es: Región
fr: Région
hi: क्षेत्र
nl: Regio
pt_br: Região
ru: Регион
tr: Bölge
uk: Регіон
vi: Vùng

source: Country
be: Краіна
es: País
fr: Pays
hi: देश
nl: Land
pt_br: País
ru: Страна
tr: Ülke
uk: Країна
vi: Quốc gia

source: Zip
be: Паштовы індэкс
es: Código Postal
fr: Code postal
nl: Postcode
pt_br: CEP
ru: Почтовый индекс
tr: Posta Kodu
uk: Поштовий індекс
vi: Mã bưu điện

source: Timezone
be: Гадзінны пояс
es: Zona horaria
fr: Fuseau horaire
hi: समयक्षेत्र
nl: Tijdzone
pt_br: Fuso horário
ru: Часовой пояс
tr: Saat Dilimi
uk: Часова зона
vi: Múi giờ

source: Coordinates
be: Каардынаты
es: Coordenadas
fr: Coordonnées
hi: निर्देशांक
nl: Coördinaten
pt_br: Coordenadas
ru: Координаты
tr: Koordinatlar
uk: Координати
vi: Tọa độ

source: Open map
be: Адкрыць карту
es: Abrir mapa
fr: Ouvrir la carte
hi: मानचित्र खोलें
nl: Kaart tonen
pt_br: Abrir mapa
ru: Открыть карту
tr: Haritayı aç
uk: Відкрити мапу
vi: Mở bản đồ

source: _Get Your IP
be: _Атрымаць ваш IP адрас
es: _Obtenga su IP
fr: _Obtenir votre IP
hi: अपना IP प्राप्त करें (_G)
nl: Mijn ip-adres opvra_gen
pt_br: _Obter Seu IP
ru: _Получить ваш IP адрес
tr: _IP Adresimi Getir
uk: _Отримати вашу IP адресу
vi: _Lấy IP của bạn

source: _Keyboard Shortcuts
be: _Спалучэнні клавіш
es: _Atajos de teclado
fr: Raccourcis _clavier
hi: कीबोर्ड शॉर्टकट (_K)
nl: _Sneltoetsen
pt_br: _Atalhos de Teclado
ru: _Горячие клавиши
tr: _Klavye Kısayolları
uk: _Клавіатурні скорочення
vi: _Phím Tắt Bàn Phím

source: _About IP Lookup
be: _Пра IP Lookup
es: _A cerca de IP Lookup
fr: À _propos de Recherche d’IP
hi: IP Lookup के बारे में (_A)
nl: Over ip-op_zoeking
pt_br: _Sobre o IP Lookup
ru: _Про IP Lookup
tr: IP Sorgula _Hakkında
uk: _Про IP Lookup
vi: _Giới thiệu Tra cứu IP

source: _Close
be: _Закрыць
es: _Cerrar
fr: _Fermer
hi: बंद करे (_C)
nl: _Sluiten
pt_br: _Fechar
ru: _Закрыть
tr: _Kapat
uk: _Зачинити
vi: _Đóng

# shortcut window
source: General
be: Агульныя
fr: Général
hi: सामान्य
nl: Algemeen
pt_br: Geral
ru: Основные
tr: Genel
uk: Загальні
vi: Chung

# shortcut window
source: Show Shortcuts
be: Паказаць спалучэнні клавіш
es: Mostrar atajos
fr: Afficher les raccourcis clavier
hi: शॉर्टकट दिखाएं
nl: Sneltoetsen tonen
pt_br: Mostrar Atalhos
ru: Показать горячие клавиши
tr: Kısayolları Göster
uk: Показати клавіатурні скорочення
vi: Hiển Thị Phím Tắt

# shortcut window
source: Quit
be: Выйсці
es: Salir
fr: Quitter
hi: छोड़ें
nl: Afsluiten
pt_br: Sair
ru: Выйти
tr: Çık
uk: Вийти
vi: Thoát

# shortcut window
source: Get Your IP
pt_br: Obter Seu IP
